**"Indexing and Selecting Data":-**

In [1]:
import pandas as pd

In [2]:
Data = [(1,'Vikas',31,'male','Raipur'),
        (2,'Amir',32,'male','Bilaspur'),
        (3,'Tushar',33,'male','Durg'),
        (4,'Payal',34,'female','Raipur'),
        (5,'Prateek',35,'male','Korba')]
df = pd.DataFrame(Data,columns=['RollNo','Name','Age','Gender','Address'])
print(df)

   RollNo     Name  Age  Gender   Address
0       1    Vikas   31    male    Raipur
1       2     Amir   32    male  Bilaspur
2       3   Tushar   33    male      Durg
3       4    Payal   34  female    Raipur
4       5  Prateek   35    male     Korba

In [3]:
print(df.at[3,'Age'])
print(df.at[2,'Address'])
print(df.at[0,'Name'])
print(df.iat[2,2])
print(df.iat[4,1])
print(df.iat[1,3])

34
Durg
Vikas
33
Prateek
male

In [4]:
print(df.loc[:,"Age"])
print(df.loc[2:,"Age"])
print(df.loc[1:3,"Age"])

0    31
1    32
2    33
3    34
4    35
Name: Age, dtype: int64
2    33
3    34
4    35
Name: Age, dtype: int64
1    32
2    33
3    34
Name: Age, dtype: int64

In [5]:
print(df.loc[0])        # Selecting a Single Row
print(df.loc[[0,2,3]])  # Selecting Multiple Rows
print("\t")
print(df.loc[1:3])      # Selecting Rows by Range

RollNo          1
Name        Vikas
Age            31
Gender       male
Address    Raipur
Name: 0, dtype: object
   RollNo    Name  Age  Gender Address
0       1   Vikas   31    male  Raipur
2       3  Tushar   33    male    Durg
3       4   Payal   34  female  Raipur

   RollNo    Name  Age  Gender   Address
1       2    Amir   32    male  Bilaspur
2       3  Tushar   33    male      Durg
3       4   Payal   34  female    Raipur

In [6]:
print(df.iloc[1])
print(df.iloc[0:3])
# print(df.iloc[0:'Age']) {INVALID}

RollNo            2
Name           Amir
Age              32
Gender         male
Address    Bilaspur
Name: 1, dtype: object
   RollNo    Name  Age Gender   Address
0       1   Vikas   31   male    Raipur
1       2    Amir   32   male  Bilaspur
2       3  Tushar   33   male      Durg

In [7]:
# Filtering Rows:-
print(df[df['Age']>32])
print(df[df['Name']=='Amir'])

   RollNo     Name  Age  Gender Address
2       3   Tushar   33    male    Durg
3       4    Payal   34  female  Raipur
4       5  Prateek   35    male   Korba
   RollNo  Name  Age Gender   Address
1       2  Amir   32   male  Bilaspur

**"INSERTION":-**

In [8]:
# Adding new Column to Dataframe:-
df['MobileNo']=[101,203,303,440,560]
print(df)

   RollNo     Name  Age  Gender   Address  MobileNo
0       1    Vikas   31    male    Raipur       101
1       2     Amir   32    male  Bilaspur       203
2       3   Tushar   33    male      Durg       303
3       4    Payal   34  female    Raipur       440
4       5  Prateek   35    male     Korba       560

In [9]:
# Adding new Column to Dataframe by assigning Same Value:-
df['BranchCode']=22
print(df)

   RollNo     Name  Age  Gender   Address  MobileNo  BranchCode
0       1    Vikas   31    male    Raipur       101          22
1       2     Amir   32    male  Bilaspur       203          22
2       3   Tushar   33    male      Durg       303          22
3       4    Payal   34  female    Raipur       440          22
4       5  Prateek   35    male     Korba       560          22

In [10]:
# Adding new Column to Dataframe in a particular location:-
df.insert(1, "newcol", [99,58,33,11,55])

In [11]:
print(df)

   RollNo  newcol     Name  Age  Gender   Address  MobileNo  BranchCode
0       1      99    Vikas   31    male    Raipur       101          22
1       2      58     Amir   32    male  Bilaspur       203          22
2       3      33   Tushar   33    male      Durg       303          22
3       4      11    Payal   34  female    Raipur       440          22
4       5      55  Prateek   35    male     Korba       560          22

In [12]:
Data = [(1,'Vikas',31,'male','Raipur'),
        (2,'Amir',32,'male','Bilaspur'),
        (3,'Tushar',33,'male','Durg'),
        (4,'Payal',34,'female','Raipur'),
        (5,'Prateek',35,'male','Korba')]
df2 = pd.DataFrame(Data,columns=['RollNo','Name','Age','Gender','Address'])
print(df2)

   RollNo     Name  Age  Gender   Address
0       1    Vikas   31    male    Raipur
1       2     Amir   32    male  Bilaspur
2       3   Tushar   33    male      Durg
3       4    Payal   34  female    Raipur
4       5  Prateek   35    male     Korba

In [13]:
# Adding new Row to Dataframe in a particular location:-
df2.loc[7]=[15,'Anjali',25,'female','Raigarh']
print(df2)

   RollNo     Name  Age  Gender   Address
0       1    Vikas   31    male    Raipur
1       2     Amir   32    male  Bilaspur
2       3   Tushar   33    male      Durg
3       4    Payal   34  female    Raipur
4       5  Prateek   35    male     Korba
7      15   Anjali   25  female   Raigarh

**"Deletion":-**

In [14]:
# Deleting a column from Dataframe:-
df = df.drop(columns=['MobileNo'])
print(df)

   RollNo  newcol     Name  Age  Gender   Address  BranchCode
0       1      99    Vikas   31    male    Raipur          22
1       2      58     Amir   32    male  Bilaspur          22
2       3      33   Tushar   33    male      Durg          22
3       4      11    Payal   34  female    Raipur          22
4       5      55  Prateek   35    male     Korba          22

In [15]:
# Deleting multiple columns from Dataframe:-
df =df.drop(columns=['Gender','BranchCode'])
print(df)

   RollNo  newcol     Name  Age   Address
0       1      99    Vikas   31    Raipur
1       2      58     Amir   32  Bilaspur
2       3      33   Tushar   33      Durg
3       4      11    Payal   34    Raipur
4       5      55  Prateek   35     Korba

In [16]:
# Deleting column from Dataframe using 'del':-
del df['Age']
print(df)

   RollNo  newcol     Name   Address
0       1      99    Vikas    Raipur
1       2      58     Amir  Bilaspur
2       3      33   Tushar      Durg
3       4      11    Payal    Raipur
4       5      55  Prateek     Korba

In [17]:
# Deleting Particular row:-
df2 = df2.drop(4)
print(df2)

   RollNo    Name  Age  Gender   Address
0       1   Vikas   31    male    Raipur
1       2    Amir   32    male  Bilaspur
2       3  Tushar   33    male      Durg
3       4   Payal   34  female    Raipur
7      15  Anjali   25  female   Raigarh

In [18]:
# Deleting multiple rows:-
df2 = df2.drop([1,3])
print(df2)

   RollNo    Name  Age  Gender  Address
0       1   Vikas   31    male   Raipur
2       3  Tushar   33    male     Durg
7      15  Anjali   25  female  Raigarh

In [19]:
# Deleting multiple rows by using Slicing:-
df = df.drop(df.index[1:3])
print(df)             # "inplace=False" {Default}

   RollNo  newcol     Name Address
0       1      99    Vikas  Raipur
3       4      11    Payal  Raipur
4       5      55  Prateek   Korba

In [20]:
# Deleting multiple rows by using Slicing:-
df.drop(df.index[1:3],inplace=True)
print(df)

   RollNo  newcol   Name Address
0       1      99  Vikas  Raipur

**"Renaming & Updating":-**

In [21]:
# Renaming a column:-
df2 = df2.rename(columns={'Age':'StudentAge'})
print(df2)

   RollNo    Name  StudentAge  Gender  Address
0       1   Vikas          31    male   Raipur
2       3  Tushar          33    male     Durg
7      15  Anjali          25  female  Raigarh

In [22]:
# Renaming multiple columns:-
df2 = df2.rename(columns={'Age':'StudentAge','Name':'StudentName'})
print(df2)

   RollNo StudentName  StudentAge  Gender  Address
0       1       Vikas          31    male   Raipur
2       3      Tushar          33    male     Durg
7      15      Anjali          25  female  Raigarh

In [23]:
# Updating single Value:-
df2.loc[7,'RollNo']=60
print(df2)

   RollNo StudentName  StudentAge  Gender  Address
0       1       Vikas          31    male   Raipur
2       3      Tushar          33    male     Durg
7      60      Anjali          25  female  Raigarh

In [24]:
# Updating multiple Values:-
df2.loc[[0,2],'Address']= ['Surat','Jaipur']
print(df2)

   RollNo StudentName  StudentAge  Gender  Address
0       1       Vikas          31    male    Surat
2       3      Tushar          33    male   Jaipur
7      60      Anjali          25  female  Raigarh